/*
 * 	1. 데이터 저장 및 활용
 * 	데이터 저장 : 한개 /여러개 한번에 저장
 * 			   변수 / 	배열,클래스
 * 	
 *  데이터 활용 : 연산자/제어문
 *  
 *  2.자바에서 지원하는 데이터형
 * 	-정수 byte,int(default),long
 * 	-실수 float,double(default)
 * 	-문자 char 문자 1개 저장 ' '로 표기
 *  -논리 boolean 1byte false/true
 * 
 *  3. 변수 선언
 *  - 선언과 동시에 값을 저장
 *  - 선언후에 값을 저장
 *  - 값을 데이터형이 가지고 있는 경우
 *  
 *  4. 변수는 반드시 초기화
 *  
 *  5. 변수명 제작(식별자)
 *  - 변수명 중복X
 *  - 알파벳,한글로 시작(숫자로 시작X)
 *  - 대소문자 구분
 *  - 특수문자 사용 가능(_,$)
 *  - 예약어X
 *  
 */
public class 변수정리 {
	public static void main(String[] args) {
		
	}
}
